"""
1. Визначте значення змінної «a» після виконання фрагмента програми:
   a = 10
   b = 5
   if a < 5 and b > 10:
     a = 5

2. Визначте значення змінної «a» після виконання фрагмента програми:
   a = 10
   b = 5
   if a > 5 and a < b:
     a -= 5

3. Визначте значення змінної «a» після виконання фрагмента програми:
   a = 10
   b = 5
   if a > 1 or a < b:
     a -= 5
   if a > 1 and a == b:
     a -= 5

4. Визначте значення змінної «a» після виконання фрагмента програми:
   a = 10
   b = 5
   if a > 1 and a < b:
     a -= 5
   if a > 1 and a == b:
     a -= 5

5. Яку логічну операцію потрібно додати до програми замість крапки, щоб значення змінної «a» після виконання фрагмента програми дорівнювало 17?
   a = 10
   b = 5
   if a > 1 ... a < b:
     a -= 7
   else:
     a += 7

6. Яку логічну операцію потрібно додати до програми замість крапки, щоб значення змінної «a» після виконання фрагмента програми дорівнювало 3?
   a = 10
   b = 5
   if a < 1 ... a > b:
     a -= 7
   else:
     a += 7

7. Яку логічну операцію потрібно додати до програми замість крапки, щоб значення змінної «a» після виконання фрагмента програми дорівнювало 15?
   a = 10
   b = 5
   if a < 1 ... a > b:
     a -= 5
   else:
     a += 5


-- ПРАКТИЧНІ ЗАВДАННЯ --

-----Умовні конструкції-----:

1. Користувач вводить свій вік. Якщо вік більше 18 років вивести «Ви вже дорослий». Інакше "Ви ще дитина".


2. Користувач вводить число. Якщо воно кратно 5 вивести "Діляється на 5". Якщо не кратно - "Не ділиться на 5"


3. Написати програму для знаходження мінімального та максимального числа А та В. Числа вводяться з клавіатури


4. Користувач вводить оцінку. Вивести рядок-опис оцінки, де: 1-«погано», 2 – «незадовільно», 3 – «задовільно»,
   4 – «добре», 5 – «відмінно». Якщо оцінка НЕ лежить у діапазоні 1-5, вивести «помилка».


5. Користувач вводить 3 числа. Знайти кількість позитивних та негативних чисел.


6. Користувач вводить числа, які мають лежати в діапазоні від 10 до 100.
Якщо число виходить за межі, то вивести «Помилка».
Якщо число менше 20 вивести "Маленьке".
Якщо число більше 20, але менше 50 вивести «Середнє».
Якщо більше 50 – «Велике».


-----Цикл while-----:

1.	Надрукувати ряд чисел 20 у вигляді:
20 20 20 20 20 20 20 20 20 20
Використовуючи тільки print(20)

2. Надрукувати числа від 1 до 50 використовуючи цикл while.
В результаті повинно бути:
1
2
3
...
50

3. Користувач вводить 10 чисел. Знайти сумму всіх чисел.
Підсказка:
потрібен цикл while який буде працювати 10 разів, і він 10 разів буде запитувати число.
І це число додавати к сумі інших чисел

"""

